%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 运行前请先运行qhe_LL_plot.m
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
figure
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　画布(figure)和坐标轴(axes)的尺寸设置 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
set(gcf, 'unit', 'inch', 'position', [10, 10, 3.5, 3]) % figure
set(gca, 'Position', [0.12, 0.15, 0.80, 0.75]) % axes
set(gca, 'LabelFontSizeMultiplier', 1) % 这两句话要加上
set(gca, 'TitleFontSizeMultiplier', 1) % 这两句话要加上
% set(gca, 'PlotBoxAspectRatio', [1,1,1]) % 不要用这句
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　坐标轴的方向                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
set(gca, 'XDir', 'normal')
set(gca, 'YDir', 'normal')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　坐标轴标签的命                      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
xlabel('E(meV)', 'FontSize', 10, 'FontWeight', 'bold', 'FontName', 'Arial')
ylabel('B(T)', 'FontSize', 10, 'FontWeight', 'bold', 'FontName', 'Arial')
set(gca, 'XColor', 'k')
set(gca, 'YColor', 'k')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　坐标轴的范围                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
axis([-0.04 0.04 0 13.8])
hold on
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　坐标轴上的标度                      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
set(gca,'xtick', [-0.04, -0.02, 0.00, 0.02, 0.04]);
set(gca,'xticklabel', [-0.04, -0.02, 0.00, 0.02, 0.04]);
xtickformat('%,.2f');
set(gca,'ytick', [3 6 9 12]);
set(gca,'yticklabel', [3 6 9 12]);
set(gca, 'TickLength', [0.01, 0.03])  % 第一个是Minor Tick，第二个是Major Tick，类似于Origin
set(gca, 'Box', 'on') % 框的四边
border_width = 1.5;
set(gca, 'LineWidth', border_width)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　绘制曲线                            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
alpha_value = 0.9; % 曲线的透明度
% bKp
index = 3;
eigvals_LL_current = eigvals_LL_cell_before{index, 1};
dims = eigvals_LL_cell_after{index, 2};
line_color = 'b';
line_width = 1.0;
h3 = plot(eigvals_LL_current, B_fields_list, 'Color', line_color, 'LineWidth', line_width, 'LineStyle', '--');
% 调曲线的透明度
for ii = 1:dims
    h3(ii).Color(4) = alpha_value;
end
hold on
% bK
index = 4;
eigvals_LL_current = eigvals_LL_cell_before{index, 1};
dims = eigvals_LL_cell_after{index, 2};
line_color = 'b';
line_width = 1.0;
h4 = plot(eigvals_LL_current, B_fields_list, 'Color', line_color, 'LineWidth', line_width, 'LineStyle', '-');
% 调曲线的透明度
for ii = 1:dims
    h4(ii).Color(4) = alpha_value;
end
hold on
% mK
index = 1;
eigvals_LL_current = eigvals_LL_cell_before{index, 1};
line_color = 'r';
line_width = 1.0;
h1 = plot(eigvals_LL_current, B_fields_list, 'Color', line_color, 'LineWidth', line_width, 'LineStyle', '--');
% h1.Color(4) = alpha_value;
hold on
% mKp
index = 2;
eigvals_LL_current = eigvals_LL_cell_before{index, 1};
line_color = 'r';
line_width = 1.0;
h2 = plot(eigvals_LL_current, B_fields_list, 'Color', line_color, 'LineWidth', line_width, 'LineStyle', '-');
% h2.Color(4) = alpha_value;
hold on
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　设置图例(Legend)                    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
lg_current = legend([h1(1), h2(1), h3(1), h4(1)], {'m-Kp', 'm-K', 'b-Kp', 'b-K'}, 'Location', 'northeast', 'Box', 'off', 'FontName', 'Arial', 'FontSize', 7, ...
                        'Orientation', 'horizontal', 'Location', 'northwest');                
lg_current.ItemTokenSize = [20, 1];
lg_current.NumColumns = 1;
position_legend = lg_current.Position;
lg_current.Position = [0.2, 0.7, position_legend(3), position_legend(4)]; % 只修改前面两个属性的值
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　将坐标轴的框置于顶层                %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
set(gca, 'Layer', 'top')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　(自动)保存成eps格式                 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% exportgraphics(gcf, 'D:\matlab\graphene-package\三层数据\paper_figs\figure4s\figure_4f.eps', 'ContentType', 'vector', 'Resolution', 300, 'BackgroundColor', 'none')
% exportgraphics(gcf, 'D:\matlab\graphene-package\三层数据\paper_figs\figure4s\figure_4c.eps', 'ContentType', 'vector', 'Resolution', 300, 'BackgroundColor', 'none')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%　手动设置渲染器                      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
exportsetupdlg % 设置 Render 和 dpi 即可
% set(gcf, 'Renderer', 'painter')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%　背景透明化                          %%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
pause(6)
set(gcf, 'color', 'none') % 背景透明化 
set(gca, 'color', 'none')